// DALL-E промпти для генерації зображень

export const dalleImagePrompt = (formData) => {
  return `Сформуй короткий, художній промт та опис сюжету для генерації зображення в DALL-E, стиль зображення - ${formData.cardStyle}, настрій зображення - ${formData.cardMood}, та враховуй наступне фото: ${formData.photoUrl}, для генерації подібних речей, персонажів або для натхнення сюжету (але хай DALL-E не вигадує персонажів яких немає на закріпленому фото або далі в описі).
Додай до композиції сюжету наступні атрибути та символи або ті речі які прямо асоціюються з наступними хобі, захопленнями або родом діяльності: ${formData.hobbies}. Вбудуй їх логічно та послідовно до композиції щоб все було на своїх місцях та доповнювало сюжет, але не треба малювати забагато речей на зображенні, малюй їх менше але чіткіше.
Також врахуй риси та цінності особистості: ${formData.traits}. Відобрази ці якості через візуальні символи, емоції, атмосферу або деталі композиції, які передають ці характеристики.
Також для генерації сюжету використовуй, атрибути, символи та сенси з наступного тексту привітання: ${formData.greetingText}. На основі тексту привітання будуй логічну сюжетну композицію де всі речі на своїх місцях, доповнюють композицію та при цьому не перевантажують великою кількістю не потрібних та недомальованих деталей, певні сенси тексту привітання можна проігнорувати заради подальшої чіткості композиції згенерованого зображення, але не втрачай можливості відобразити дію про яку йдеться в тексті привітання або на яку натякається для щоб композиція була не банальна та дійсно мала сюжет.
Саме згенероване зображення має бути без тексту.`;
};

export const dalleSimpleImagePrompt = (formData) => {
  return `Стиль: ${formData.cardStyle}, настрій: ${formData.cardMood}. Створи красиве зображення для привітання.`;
};

export const dalleCatImagePrompt = (formData) => {
  return `Стиль: ${formData.cardStyle}, настрій: ${formData.cardMood}. Створи зображення з кішкою для привітання. Хобі: ${formData.hobbies}.`;
}; 