// Динамічні опції для кастомних форматів генерації

export const dinamicCardStyleOptions = [
  "Мінімалістичний",
  "Класичний",
  "Сучасний", 
  "Вінтажний",
  "Футуристичний",
  "Романтичний",
  "Дитячий",
  "Елегантний",
  "Хіпстерський",
  "Ретро",
  "Бохо",
  "Скандинавський"
];

export const dinamicCardMoodOptions = [
  "Радісний",
  "Теплий", 
  "Спокійний",
  "Енергійний",
  "Романтичний",
  "Загадковий",
  "Веселий",
  "Серйозний",
  "Меланхолійний",
  "Експресивний",
  "Ніжний",
  "Драйвовий"
];

export const dinamicHobbies = [
  "Читання",
  "Музика", 
  "Спорт",
  "Подорожі",
  "Кулінарія",
  "Фотографія",
  "Малювання",
  "Садоводство",
  "Колекціонування",
  "Танці",
  "Йога",
  "Медитація",
  "Гра на інструментах",
  "Виріблення",
  "Каліграфія"
];

export const dinamicTraits = [
  "Доброзичливість",
  "Енергійність",
  "Спокій", 
  "Креативність",
  "Відповідальність",
  "Оптимізм",
  "Мудрість",
  "Чутливість",
  "Сміливість",
  "Терпіння",
  "Любопитство",
  "Амбітність",
  "Самодостатність",
  "Емпатія",
  "Лідерство"
]; 